# Асуулт
# grid нэртэй 2D массив өгөгдөнө. Энэ массив нь зөвхөн 0 болон 1 гэсэн элементүүдээс бүрдэнэ:
#     1 нь хуурай газар (арал) гэсэн утгатай.
#     0 нь ус гэсэн утгатай.
# Арал нь зөвхөн "хэвтээ" болон "босоо" байдлаар холбогдсон 1-үүдээс бүрдэнэ. grid-ийн бусад хэсгүүд нь усанд хүрээлэгдсэн.
# Input: grid[m][n] 1≤m,n≤100
# Output: арлын периметрийг олох.

def islandPerimeter(grid):
    rows, cols = len(grid), len(grid[0])
    perimeter = 0

    for r in range(rows):
        for c in range(cols):
            # Хэрэв одоогийэ нүд нь 1 бол хуурай газар
            if grid[r][c] == 1:
                #периметрийн 1 нэгжийг 4-өөр тооцно
                perimeter += 4

                # Хэрэв дээд талын нүд нь мөн 1 байвал, давхардсан ханыг тооцохгүй 2-г хасна
                if r > 0 and grid[r - 1][c] == 1:  
                    perimeter -= 2

                # Хэрэв зүүн талын нүд нь мөн 1 байвал, давхардсан ханыг тооцохгүй 2-г хасна
                if c > 0 and grid[r][c - 1] == 1:  
                    perimeter -= 2

    return perimeter
